{
  "introduction": "I am Oliver Gustafsson, a passionate software developer with a strong foundation in programming, problem-solving, and team collaboration. I thrive in environments that challenge my skills and allow me to contribute to innovative solutions, particularly in software development and interactive applications.",
  "education": "I have a completed Bachelor's degree in Computer Science from the University of Skövde (2021-2024). I also participated in the ERASMUS+ program at Universidad de Málaga, Spain, where I studied Informatics during the autumn semester of 2023.",
  "experience": "My experience includes working as a Summer Intern at Volvo IT in Skövde, Sweden, during the summer of 2023, where I contributed to the refactoring and redesign of an internal system using C#, Blazor, Fluxor, and Microsoft Azure within a SCRUM framework. I have also participated in Hackathons. Additionally, I attended the UNGATIO Design Camp in the summer of 2019.",
  "skills": "I have extensive experience in JavaScript and TypeScript, particularly in web development and full-stack applications. My background also includes working with C#, especially in the context of Blazor and .NET backend development.",
  "portfolio": "The portfolio was built using React and TypeScript, providing a robust and scalable foundation. It features a unique command-line interface (CLI) that users can interact with to explore different sections of the portfolio. For accessibility, a 'help' view with clickable buttons is available to simplify navigation. The portfolio is integrated with the GitHub API, making it easily reusable for anyone with a GitHub profile. Through customizable configuration files, users can update and tailor the content to showcase their desired information.",
  "ryggar": "My most recent project is a prompt-based drinking game built with React and TypeScript. The game features several built-in game modes, a Free Play mode for custom rules, and supports multiple languages including Swedish, English, Spanish, German, and French. I developed this project out of frustration with needing multiple apps for similar games, and focused on creating an ad-free, visually appealing experience that enhances user enjoyment. This project allowed me to further refine my skills in developing user-friendly, good-looking interfaces while ensuring a smooth and engaging user experience."
}
